Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: When the R.styleable.DatePicker_datePickerMode attribute is set to calendar, the month and day can be selected using a calendar-style view while the year can be selected separately using a list.
zh_cn: 当 R.styleable.DatePicker_datePickerMode 属性设置为 calendar 时，可以使用日历样式 view 选择月和日，可以使用列表单独选择年。

source: When the R.styleable.DatePicker_datePickerMode attribute is set to spinner, the date can be selected using year, month, and day spinners or a CalendarView.
zh_cn: 当 R.styleable.DatePicker_datePickerMode 属性设置为 spinner 时，可以使用年，月，日旋转器或 CalendarView。

source: When the android:theme attribute is used in XML, the specified theme is applied on top of the inflation context's theme (see LayoutInflater) and used for the view itself as well as any child elements.
zh_cn: 当在 XML 文件中使用 android:theme 属性时，所指明的主题应用于加载的 context 的主题之上(见 LayoutInflater)，并且用于 view 自身及其所有子元素。

source: When the GridLayout#setUseDefaultMargins(boolean) property is set, default margins around children are automatically allocated based on the prevailing UI style guide for the platform.
zh_cn: 设置 GridLayout#setUseDefaultMargins(boolean) 属性后，将根据平台的主流 UI 样式指南自动分配子项周围的默认边距。

source: When the lint tool discovers a potentially unused resource in your project, it prints a message like the following example.
zh_cn: 当 lint 工具发现项目中可能未使用的资源时，它会输出类似以下示例的消息。

source: When the SearchView is used in an ActionBar as an action view, it's collapsed by default, so you must provide an icon for the action.
zh_cn: 当 SearchView 在 ActionBar 中用作操作 view 时，默认情况下会将其折叠，因此你必须为操作提供图标。

source: When the SearchView is used in an ActionBar as an action view for a collapsible menu item, it needs to be set to iconified by default using setIconifiedByDefault(true).
zh_cn: 当 SearchView 在 ActionBar 中用作可折叠菜单项的操作 view 时，需要使用 setIconifiedByDefault(true) 将其设置为图标化。

source: When the bugs are fixed in the support library you can remove these color definitions.
zh_cn: 当错误在支持库中修复时，你可以移除这些颜色定义。

source: When the button is pressed or clicked, the state changes automatically.
zh_cn: 按下或单击按钮时，状态会自动更改。

source: When the class is nested in the NoteEditor class, this technique will not work.
zh_cn: 当这个类嵌套在 NoteEditor 类中时，这个技巧将无效。

source: When the compiler complains you're not catching an exception, don't scowl.
zh_cn: 当编译器抱怨你没有捕获异常时，别闷闷不乐！。

source: When the id of another view is set on a placeholder (using setContent()), the placeholder effectively becomes the content view.
zh_cn: 当在占位符上设置另一个 view 的 id 时(使用 setContent())，占位符实际上成为内容 view。

source: When the mode is applied, it will be given the result from shader A as its "dst", and the result from shader B as its "src".
zh_cn: 在应用模式时，将会将着色器 A 的结果作为其 "dst"，并将着色器 B 的结果作为其 "src"。

source: When the nested scroll is finished this ViewParent will receive a call to onStopNestedScroll(View).
zh_cn: 嵌套滚动完成后，此 ViewParent 将接收对 onStopNestedScroll(View) 的调用。

source: When the principle of flexibility does not provide complete disambiguation, GridLayout's algorithms favour rows and columns that are closer to its right and bottom edges.
zh_cn: 当灵活性原则不能提供完全消歧时，GridLayout 的算法更倾向于更靠近 right (右) 和 bottom (底部) 边缘的行和列。

source: When the radio button is unchecked, the user can press or click it to check it.
zh_cn: 当单选按钮未选中时，用户可以按或单击来选中它。

source: When the stack finishes, the permissions are automatically removed.
zh_cn: 堆栈完成后，权限将自动删除。

source: When the user selects a tab, this object sends a message to the parent container, TabHost, to tell it to switch the displayed page.
zh_cn: 当用户选择一个选项卡时，该对象会向父容器 TabHost 发送一条消息，告诉它切换显示的页面。

source: When this attribute is set to true, the view gets its drawable state (focused, pressed, etc.) from its direct parent rather than from itself.
zh_cn: 当此属性设置为 true 时，view 将从其直接父级而不是从其自身获取其 drawable 状态(聚焦，按下等)。

source: When this flag is enabled for a window, it automatically sets the system UI visibility flags View.SYSTEM_UI_FLAG_LAYOUT_STABLE and View.SYSTEM_UI_FLAG_LAYOUT_FULLSCREEN.
zh_cn: 为窗口启用此标志后，它会自动设置系统 UI 可见性标志 View.SYSTEM_UI_FLAG_LAYOUT_STABLE 和 View.SYSTEM_UI_FLAG_LAYOUT_FULLSCREEN。

source: When this flag is set, if inDensity and inTargetDensity are not 0, the bitmap will be scaled to match inTargetDensity when loaded, rather than relying on the graphics system scaling it each time it is drawn to a Canvas.
zh_cn: 设置此标志时，如果 inDensity 和 inTargetDensity 不为 0，则会缩放位图以匹配 inTargetDensity 加载时，而不是依赖图形系统每次将其绘制到 Canvas 时缩放它。

source: When this flag is used with DRAG_FLAG_GLOBAL, the drag recipient will be able to request read access to the content URI(s) contained in the ClipData object.
zh_cn: 当此标志与 DRAG_FLAG_GLOBAL 一起使用时，拖动收件人将能够请求对 ClipData 对象中包含的内容 URI 的读访问权限。

source: When this flag is used with DRAG_FLAG_GLOBAL, the drag recipient will be able to request write access to the content URI(s) contained in the ClipData object.
zh_cn: 当此标志与 DRAG_FLAG_GLOBAL 一起使用时，拖动收件人将能够请求对 ClipData 对象中包含的内容 URI 的写访问权限。

source: When this flag is used with DRAG_FLAG_GLOBAL_URI_READ and/or DRAG_FLAG_GLOBAL_URI_WRITE, the URI permission grant applies to any URI that is a prefix match against the original granted URI.
zh_cn: 当此标志与 DRAG_FLAG_GLOBAL_URI_READ 和/或 DRAG_FLAG_GLOBAL_URI_WRITE 一起使用时，URI 权限授予适用于任何 URI 与原始授权 URI 匹配的前缀。

source: When this flag is used with DRAG_FLAG_GLOBAL_URI_READ and/or DRAG_FLAG_GLOBAL_URI_WRITE, the URI permission grant can be persisted across device reboots until explicitly revoked with Context.revokeUriPermission(Uri, int) Context.revokeUriPermission}.
zh_cn: 当此标志与 DRAG_FLAG_GLOBAL_URI_READ 和/或 DRAG_FLAG_GLOBAL_URI_WRITE 一起使用时，URI 权限授权可以在设备重新启动后保留直到用 Context.revokeUriPermission(Uri, int) Context.revokeUriPermission} 显式撤销。

source: When this happens, both this flag and SYSTEM_UI_FLAG_FULLSCREEN will be cleared automatically, so that both elements reappear at the same time.
zh_cn: 发生这种情况时，此标志和 SYSTEM_UI_FLAG_FULLSCREEN 将自动清除，以便两个元素同时重新出现。

source: When this is combined with incompatible options, like setMutableRequired(true) or setDecodeAsAlphaMaskEnabled(true), decodeDrawable or decodeBitmap will throw an IllegalStateException.
zh_cn: 当这与不兼容的选项结合使用时，例如 setMutableRequired(true) 或 setDecodeAsAlphaMaskEnabled(true)，decodeDrawable 或 decodeBitmap 将抛出 IllegalStateException。

source: When this occurs the user may slide the topmost view out of the way by dragging it, or by navigating in the direction of the overlapped view using a keyboard.
zh_cn: 当发生这种情况时，用户可以通过拖动最上面的 view 来滑动，或者通过使用键盘在重叠 view 的方向上导航。

source: When true, automatically start animating.
zh_cn: 如果为 true，则自动开始动画。

source: When turned on, it automatically creates two or more constraints for each view as you add them to the layout, but only when appropriate to constrain the view to the parent layout.
zh_cn: 打开时，它会在你将每个 view 添加到布局时自动为其创建两个或多个约束，但只有在适当时才将 view 约束到父布局。

source: When using FragmentPagerAdapter the host ViewPager must have a valid ID set.
zh_cn: 当使用 FragmentPagerAdapter 时，ViewPager 必须设置一个有效的 ID。

source: When using a RatingBar that supports user interaction, placing widgets to the left or right of the RatingBar is discouraged.
zh_cn: 使用支持用户交互的 RatingBar 时，不建议将小部件放在 RatingBar 的左侧或右侧。

source: When using a start icon, the 'start/left' compound drawable of the EditText will be overridden.
zh_cn: 使用开始图标时，将覆盖 EditText 的 'start/left' 复合 drawable。

source: When using the CPU Profiler, pay attention to your app’s Application subclass constructors and com.example.customApplication.onCreate() methods.
zh_cn: 使用 CPU Profiler 时，请注意应用程序的 Application 子类构造函数和 com.example.customApplication.onCreate() 方法。

source: When using this flag, if a task is already running for the activity you are now starting, then a new activity will not be started; instead, the current task will simply be brought to the front of the screen with the state it was last in.
zh_cn: 使用此标志时，如果任务已在为你正在启动的 activity 运行，则不会启动新的 activity；相反，当前任务只会带到屏幕前面，并显示其上次所处的状态。

source: When using this flag, the application should provide some easy facility for the user to go out of it.
zh_cn: 使用此标志时，应用程序应为用户提供一些简单的便利设施。

source: When views do not overlap weight behaves as it does in a LinearLayout.
zh_cn: 当 view 不重叠时，权重的行为与在 LinearLayout 中的行为相同。

source: When views do overlap, weight on a slideable pane indicates that the pane should be sized to fill all available space in the closed state.
zh_cn: 当 view 重叠时，可滑动面板上的权重指示应调整窗格大小以填充处于关闭状态的所有可用空间。

source: When we are finished, the new class will be able to substitute for a normal EditText view.
zh_cn: 当我们完成后，新的类可以替换一个正常的 EditText 类。

source: When working with nested scrolling often the parent view may want an opportunity to consume the scroll before the nested scrolling child does.
zh_cn: 在使用嵌套滚动时，父 view 可能希望有机会在嵌套滚动子项之前使用滚动。

source: When working with such code, it's okay to continue the existing style.
zh_cn: 使用此类代码时，可以继续遵循现有样式。

source: When writing a RecyclerView.LayoutManager you almost always want to use layout positions whereas when writing an RecyclerView.Adapter, you probably want to use adapter positions.
zh_cn: 当你在写 RecyclerView.LayoutManager 时，你几乎总是想要使用 layout positions，反之当写 RecyclerView.Adapter 时，你几乎总是想要使用 adapter positions。

source: When writing a custom view, implement this interface to return the default behavior when used as a direct child of an CoordinatorLayout.
zh_cn: 编写自定义 view 时，实现此接口以在用作 CoordinatorLayout 的直接子项时返回默认行为。

source: When you add a constraint to both sides of a view (and the view size for the same dimension is either "fixed" or "wrap content"), the view becomes centered between the two constraints with a bias of 50% by default.
zh_cn: 当向 view 的两侧添加约束时(并且 view 的尺寸的大小为 "fixed" 或 "wrap content")，默认情况下，view 将在两个约束之间居中，偏差为 50%。

source: When you add a view in a ConstraintLayout, it displays a bounding box with square resizing handles on each corner and circular constraint handles on each side.
zh_cn: 当你在 ConstraintLayout 中添加一个 view 时，它会显示一个边框，每个角上都有方形调整大小的手柄，每边都有圆形的约束手柄。

source: When you call Intent.setFlags() on the Intent to set temporary access permissions, the same permissions are applied to all of the content URIs.
zh_cn: 在 Intent 上调用 Intent.setFlags() 来设置临时访问权限时，将应用相同的权限到所有的 content URI。

source: When you create an Intent containing a content URI, in order to send the content URI to a client app, you can also call Intent.setFlags() to add permissions.
zh_cn: 当你创建包含 content URI 的 Intent 时，为了将 content URI 发送到客户端应用程序，还可以调用 Intent.setFlags() 添加权限。

source: When you define an edit text widget, you must specify the R.styleable.TextView_inputType attribute.
zh_cn: 定义编辑文本小部件时，必须指定 R.styleable.TextView_inputType 属性。

source: When you drop a view into the Layout Editor, it stays where you leave it even if it has no constraints.
zh_cn: 当你拖动一个 view 到布局编辑器中，它会停留在你放开它的地方，即使它没有任何约束。

source: When you pass onTouchEvent() a touch event that it doesn't recognize as part of a gesture, it returns false.
zh_cn: 当你传递 onTouchEvent() 触摸事件时，它无法识别为手势的一部分，它将返回 false。

source: When you release, the constraint is made, with a default margin separating the two views.
zh_cn: 当你松开时，约束就会创建，两个 view 间用 a default margin 隔开。

source: When you set the app:singleSelection attribute, checking one chip that belongs to a chip group unchecks any previously checked chip within the same group.
zh_cn: 设置 app:singleSelection 属性时，选中属于 chip 组的一个 chip 将取消选中同一组中之前已选中的 chip。

source: When you use this approach, you can add multiple ClipData objects to the Intent, each with its own content URI.
zh_cn: 当你使用这种方法时，你可以添加多个 ClipData 对象到 Intent ，每个都有其自己的 content URI 。

source: When you use this method, the value that logcat displays is the time elapsed from the creation of the application object to the moment reportFullyDrawn() is called.
zh_cn: 使用此方法时，logcat 显示的值是从创建应用程序对象到调用 reportFullyDrawn() 的时间。

source: When you want to use class Bar from package foo,there are two possible ways to import it:
zh_cn: 当你想要使用 foo 包中的 Bar 类时，可以使用以下两种方式导入：

source: When your application launches, the blank starting window remains on the screen until the system finishes drawing the app for the first time.
zh_cn: 当你的应用程序启动时，空白的启动窗口将保留在屏幕上，直到系统首次完成绘制应用程序。

source: When your view is assigned a size, the layout manager assumes that the size includes all of the view's padding.
zh_cn: 为 view 指定大小时，布局管理器会假定该大小包含所有 view 的 padding。

source: Whenever setText(java.lang.CharSequence) is called, TextSwitcher animates the current text out and animates the new text in.
zh_cn: 每当调用 setText(java.lang.CharSequence) 时，TextSwitcher 会将当前文本设置为动画，并为其中的新文本设置动画。

source: Whether do show week numbers.
zh_cn: 是否显示周数。

source: Whether items in data set have unique identifiers or not.
zh_cn: 数据集中的项是否具有唯一标识符。

source: Whether or not this view is a heading for accessibility purposes.
zh_cn: 此 view 是否是用于辅助功能的标题。

source: Whether or not you use GestureDetector.SimpleOnGestureListener, you must always implement an onDown() method that returns true.
zh_cn: 无论你是否使用 GestureDetector.SimpleOnGestureListener，你必须始终实现返回 true 的 onDown() 方法。

source: Whether the calendar view is shown.
zh_cn: 是否显示日历 view。

source: Whether the image is animated.
zh_cn: 图像是否动画。

source: Whether the problem lies with unnecessary initializations or disk I/O, the solution calls for lazy-initializing objects: initializing only those objects that are immediately needed.
zh_cn: 无论问题在于不必要的初始化还是磁盘 I/O，解决方案都会调用延迟初始化对象：仅初始化那些立即需要的对象。

source: Whether the spinners are shown.
zh_cn: 是否显示微调器。

source: Whether this View should use a default focus highlight when it gets focused but doesn't have R.attr.state_focused defined in its background.
zh_cn: 此 view 在聚焦时是否应使用默认焦点高亮，但在其背景中未定义 R.attr.state_focused。

source: Whether this rating bar is an indicator (and non-changeable by the user).
zh_cn: 此分级栏是否为指示器(用户不可更改)。

source: Whether this view has elements that may overlap when drawn.
zh_cn: 此 view 是否具有在绘制时可能重叠的元素。

source: Whether this view is a default-focus view.
zh_cn: 此 view 是否为默认焦点 view。

source: Whether this view is a root of a keyboard navigation cluster.
zh_cn: 此 view 是否是键盘导航集群的根。

source: Whether this view should be treated as a focusable unit by screen reader accessibility tools.
zh_cn: 是否应将此视图视为屏幕阅读器辅助功能工具的可聚焦单元。

source: Whether to draw on/off text.
zh_cn: 是否绘制开/关文本。

source: Whether to split the track and leave a gap for the thumb drawable.
zh_cn: 是否分割轨道并留下 thumb drawable 的间隙。

source: While a MaterialToolbar with a transparent background can be used within an AppBarLayout, in terms of elevation overlays its main value comes into play with the standalone Toolbar case, when using the Widget.MaterialComponents.Toolbar.Surface style with elevation.
zh_cn: 虽然具有透明背景的 MaterialToolbar 可以在 AppBarLayout 中使用，但就高程覆盖而言，其主要值与独立 Toolbar 案例，当使用带有高程的 Widget.MaterialComponents.Toolbar.Surface 样式时。

source: While an action bar is traditionally part of an Activity's opaque window decor controlled by the framework, a Toolbar may be placed at any arbitrary level of nesting within a view hierarchy.
zh_cn: 虽然操作栏传统上是框架控制的 Activity's 不透明窗口装饰的一部分，但工具栏可以放置在 view 层次结构中的任意嵌套层级。

source: While both have default behavior, the default onDraw() will do nothing, and the default onMeasure() will always set a size of 100x100 — which is probably not what you want.
zh_cn: 虽然这 2 个方法都有默认的行为，默认的 onDraw() 什么也不做，默认的 onMeasure() 将设置尺寸为 100x100 — 这可能并不是你想的。

source: While inPurgeable can help avoid big Dalvik heap allocations (from API level 11 onward), it sacrifices performance predictability since any image that the view system tries to draw may incur a decode delay which can lead to dropped frames.
zh_cn: 虽然 inPurgeable 可以帮助避免大 Dalvik 堆分配(从 API 级别 11 开始)，但它牺牲了性能可预测性，因为视图系统尝试绘制的任何图像都可能导致解码延迟，从而导致丢帧。

source: While it is not possible to uncheck a particular radio button, the radio group can be cleared to remove the checked state.
zh_cn: 虽然无法取消选中特定单选按钮，但可以清除单选组以移除选中状态。

source: While logging is necessary, it has a significantly negative impact on performance and quickly loses its usefulness if not kept reasonably terse.
zh_cn: 虽然日志记录非常有必要，但对性能却有明显的负面影响，如果不能保持一定程度的简洁性，就会迅速失去其实用性。

source: While much discussion has surrounded this rule, the decision remains that 100 characters is the maximum with the following exceptions:
zh_cn: 虽然关于此规则存在很多争论，但最终决定仍是以 100 个字符为上限，with the following exceptions：

source: While the name attribute is a URI path segment, the path value is an actual subdirectory name.
zh_cn: 虽然 name 属性是一个 URI 路径段，但 path 值是一个实际的子目录名称。

source: While they can be handy for doing cleanup (particularly of external resources), there are no guarantees as to when a finalizer will be called (or even that it will be called at all).
zh_cn: 虽然终结器非常便于进行资源清理(尤其是外部资源)，但并不能保证终结器何时被调用(甚至根本不会被调用)。

source: While you may think your code will never encounter this error condition or that it is not important to handle it, ignoring exceptions as above creates mines in your code for someone else to trigger some day.
zh_cn: 虽然你可能认为自己的代码永远不会遇到这种错误，或者无需费心处理这种错误，但像上例那样忽略异常会在你的代码中埋下隐患，这种错误总有一天会被他人触发。

source: Widget used to show an image with the standard QuickContact badge and on-click behavior.
zh_cn: 窗口小部件用于显示具有标准 QuickContact 徽章和点击行为的图像。

source: Widgets are referenced by being added to a comma separated list of ids, e.g:
zh_cn: 通过添加到逗号分隔的 id 列表来引用小部件，例如：

source: Widgets can then be constrained to a Guideline, allowing multiple widgets to be positioned easily from one Guideline, or allowing reactive layout behavior by using percent positioning.
zh_cn: 然后，部件可以由 Guideline 限制，允许多个部件根据 Guideline 轻松地定位，或通过百分比定位来允许响应式布局。

source: Widgets can then be positioned by constraining them to such guidelines.
zh_cn: 然后部件可以通过这样的 guideline 来约束定位。

source: Widgets dimension constraints
zh_cn: 小部件尺寸约束

source: Width is always MATCH_PARENT.
zh_cn: 宽度始终为 MATCH_PARENT。

source: Width of the dropdown in spinnerMode="dropdown".
zh_cn: spinnerMode="dropdown" 中下拉列表的宽度。

source: Width of the stroke used to draw the gesture.
zh_cn: 用于绘制手势的笔划宽度。

source: Will be called if there is an error in the input.
zh_cn: 如果输入中有错误，将被调用。

source: Will typically result in a Bitmap.Config.HARDWARE allocation, but may be software for small images.
zh_cn: 通常会产生 Bitmap.Config.HARDWARE 分配，但如果是小图像则为软件分配。

source: Window flag: request a translucent status bar with minimal system-provided background protection.
zh_cn: 窗口标志：请求半透明状态栏，系统提供的背景保护最小。

source: With a VectorDrawable object, a 100-byte file can generate a sharp image the size of the screen.
zh_cn: 使用 VectorDrawable 对象，100 字节的文件可以生成与屏幕大小相同的清晰图像。

source: With an intent, the app uses only a subset of the previously initialized state data.
zh_cn: 根据 intent，应用程序仅使用先前初始化的状态数据的子集。

source: With hardware-acceleration, intermediate cache layers are largely unnecessary and can easily result in a net loss in performance due to the cost of creating and updating the layer.
zh_cn: 通过硬件加速，中间缓存层在很大程度上是不必要的，并且由于创建和更新层的成本，很容易导致性能的净损失。

source: With this configuration, each pixel requires 1 byte of memory.
zh_cn: 采用这种配置，每个像素需要 1 个字节的内存。

source: Within a given module, other than at the VERBOSE level, an error should only be reported once if possible.
zh_cn: 在指定模块中，除了 VERBOSE 级别之外，一个错误应该只报告一次（如果可能的话）。

source: Within a single chain of function calls within a module, only the innermost function should return the error, and callers in the same module should only add some logging if that significantly helps to isolate the issue.
zh_cn: 在模块内的单个函数调用链中，只有最内层的函数应当返回错误，同一模块中的调用者只能添加一些明显有助于隔离问题的日志记录。

source: Without a strokeColor, the card will not render a stroked border, regardless of the strokeWidth value.
zh_cn: 如果没有 strokeColor，则无论 strokeWidth 值如何，卡都不会呈现描边边框。

source: Without one, an error will result in an Exception being thrown.
zh_cn: 若没有设置一个，错误将导致抛出 Exception。

source: Wrapper layout for views that can react to an ExpandableWidget's setExpanded(boolean) state changes by transforming the ExpandableWidget into itself.
zh_cn: 包装器布局 view，通过将 ExpandableWidget 装入自己，这些 view 可以对 ExpandableWidget 的 setExpanded(boolean) 状态做出反应。

source: Write Short Methods
zh_cn: 编写简短方法

source: Write a compressed version of the bitmap to the specified outputstream.
zh_cn: 将位图的压缩版本写入指定的输出流。

source: XML attributes
zh_cn: XML 属性

source: XML resource that carries a boolean value.
zh_cn: 带有布尔值的 XML 资源。

source: XML resource that carries a color value (a hexadecimal color).
zh_cn: 带有颜色值(十六进制颜色)的 XML 资源。

source: XML resource that carries a dimension value (with a unit of measure).
zh_cn: 带有尺寸值(带有度量单位)的 XML 资源。

source: XML resource that carries an integer value.
zh_cn: 包含整数值的 XML 资源。

source: XML resource that provides a TypedArray (which you can use for an array of drawables).
zh_cn: 提供 TypedArray 的 XML 资源(可用于可绘制数组)。

source: XML resource that provides a unique identifier for application resources and components.
zh_cn: 为应用程序资源和组件提供唯一标识符的 XML 资源。

source: XML resource that provides an array of integers.
zh_cn: 提供整数数组的 XML 资源。

source: Xfermode is the base class for objects that are called to implement custom "transfer-modes" in the drawing pipeline.
zh_cn: Xfermode 是被调用来在绘图管道中实现自定义 "传输模式" 的对象的基类。

source: You add a text watcher using the TextView#addTextChangedListener method.
zh_cn: 你使用 TextView#addTextChangedListener 方法添加文本观察器。

source: You also can receive callbacks as a user changes text by adding a TextWatcher to the edit text.
zh_cn: 通过向编辑文本添加 TextWatcher，当用户更改文本时，你也可以接收回调。

source: You also need to make your view respond to user input in a way that closely resembles the real-world action you're mimicking.
zh_cn: 你还需要使 view 以与你模仿的真实动作非常相似的方式响应用户输入。

source: You can add a vertical or horizontal guideline to which you can constrain views, and the guideline will be invisible to app users.
zh_cn: 你可以添加可以约束 view 的垂直或者水平的参考线，并且该参考线对于应用用户而言是不可见的。

source: You can add views either from code or by specifying a tree of views in one or more XML layout files.
zh_cn: 你即可以通过代码添加 view，也可以在一个或多个 XML 文件中申明 view 树。

source: You can address this issue as follows:
zh_cn: 你可以按如下方式解决此问题：

source: You can adjust this default by setting the android:max attribute.
zh_cn: 你可以通过设置 android:max 属性来调整此默认值。

source: You can also add items to TabLayout in your layout through the use of TabItem.
zh_cn: 你还可以通过使用 TabItem 将项目添加到布局中的 TabLayout。

source: You can also choose to skip converting any files where the encoded version would be larger than the original, or any files with transparency or an alpha channel.
zh_cn: 你还可以选择跳过转换编码版本大于原始文件的任何文件，或任何具有透明度或 Alpha 通道的文件。

source: You can also create listeners for events that your contained views might generate, for example, a listener method for the List Item Click Listener to update the contents of the EditText if a list selection is made.
zh_cn: 你也可以监听器来临听内部容纳的 view 产生的事件，比如如果设置了 list 选项，可以设置 List Item 的点击监听器来更新 EditText 的内容。

source: You can also define an optional drawable section of the image (effectively, the padding lines) by drawing a line on the right and bottom lines.
zh_cn: 你可以选择，通过在右边框或上边框画线，来定义图片的绘制区域，(本质上，就是 paddding 线。)。

source: You can also define one dimension of a widget as a ratio of the other one.
zh_cn: 你还可以把一个小部件的一个尺寸定义为相对于另一个的比例。

source: You can also gain insight into potential bottlenecks through inline tracing inside of your apps’ and activities’ onCreate() methods.
zh_cn: 你还可以通过内嵌跟踪应用程序和 activity 的 onCreate() 方法来深入了解潜在的瓶颈。

source: You can also measure the time to initial display by running your app with the ADB Shell Activity Manager command.
zh_cn: 你还可以使用 ADB Shell Activity Manager 命令运行应用程序来测量初始显示的时间。

source: You can also modify various characteristics of the action bar or remove it completely.
zh_cn: 你还可以修改操作栏的各种特征或完全移除它。

source: You can also omit resources that are only a rotated equivalent of another resource.
zh_cn: 你还可以省略仅与另一个资源的旋转等价的资源。

source: You can also put the content URI in a ClipData object and then add the object to an Intent you send to a client app.
zh_cn: 你也可以将 content URI 放在 ClipData 对象中，然后将该对象添加到发送给客户端应用的 Intent 。

source: You can also reduce your APK size by procedurally rendering your images.
zh_cn: 你还可以通过程序化渲染图片来缩小 APK 尺寸。
